TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РабочаяСмена/гкс_РабочаяСмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РабочаяСмена</name>
  <registerRecords>InformationRegister.гкс_СостоянияОбработкиСудов</registerRecords>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>AccumulationRegister.гкс_ВыработкаСмены</registerRecords>
  <registerRecords>AccumulationRegister.гкс_ОбработкаСудов</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСутки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбработкаСудна</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Силос</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весы</name>
      <type>
        <types>CatalogRef.гкс_ОборудованиеПЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыгруженПолностью</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистрации</name>
      <type>
        <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СостоянияОбработкиСудов/гкс_СостоянияОбработкиСудов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СостоянияОбработкиСудов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.гкс_СостоянияОбработкиСудна</types>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныеСутки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Силос</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </resources>
  <attributes>
    <name>Коносамент</name>
    <type>
      <types>DocumentRef.гкс_ТранспортныйДокумент</types>
    </type>
  </attributes>
  <attributes>
    <name>Весы</name>
    <type>
      <types>CatalogRef.гкс_ОборудованиеПЛК</types>
    </type>
  </attributes>
  <dimensions>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Трюм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ПланыРазгрузкиСудов/гкс_ПланыРазгрузкиСудов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ПланыРазгрузкиСудов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПорядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Трюм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияОбработкиСудна/гкс_СостоянияОбработкиСудна.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияОбработкиСудна</name>
  <enumValues>
    <name>Выгружается</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаОстановлена</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РабочаяСмена/Forms/ПомощникЗаполнения/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Свойство("РабочаяСмена", РабочаяСмена) Тогда
		ТекстСообщения = НСтр("ru = 'Форма не предназначена для непосредственного использования'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Фрахт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочаяСмена, "Фрахт");
	Параметры.Свойство("ВидОперации", ВидОперации);
	ПодготовитьФормуПоВидуОперации();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	НачатьИзменениеВидаОперации();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРекомендованныеСкладыПриИзменении(Элемент)
	УстановитьПараметрыВыбораСилоса();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбработкаСудна

&НаКлиенте
Процедура ОбработкаСуднаПриАктивизацииСтроки(Элемент)
	УстановитьПараметрыВыбораСилоса();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСуднаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСуднаСилосПриИзменении(Элемент)
	ОбновитьФлагПоСтрокеОбработкиСудна("Силос");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСуднаВесыПриИзменении(Элемент)
	ОбновитьФлагПоСтрокеОбработкиСудна("Весы");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСуднаКоличествоПриИзменении(Элемент)
	ОбновитьФлагПоСтрокеОбработкиСудна("Количество");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСуднаНовыйСилосПриИзменении(Элемент)
	ОбновитьФлагПоСтрокеОбработкиСудна("НовыйСилос");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	ТекстСообщения = "";
	Если ВидОперации = "НачатьРазгрузку" Тогда
		ПрименитьПоВидуОперацииНачатьРазгрузку();
	ИначеЕсли ВидОперации = "ЗакончитьРазгрузку" Тогда
		ПрименитьПоВидуОперацииЗакончитьРазгрузку();
	ИначеЕсли ВидОперации = "СменитьСилос" Тогда
		ПрименитьПоВидуОперацииСменитьСилос(ТекстСообщения);
		Если Не ПустаяСтрока(ТекстСообщения) Тогда
			ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		КонецЕсли;
	Иначе
		Возврат; // Замечания SQ
	КонецЕсли;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуПоВидуОперации()
	
	ОбработкаСудна.Очистить();
	Если ВидОперации = "НачатьРазгрузку" Тогда
		Элементы.ОбработкаСуднаКоличество		.Видимость = Ложь;
		Элементы.ОбработкаСуднаВыгруженПолностью.Видимость = Ложь;
		Элементы.ОбработкаСуднаНовыйСилос		.Видимость = Ложь;
		Элементы.ОбработкаСуднаСилос			.ТолькоПросмотр = Ложь;
		Элементы.ОбработкаСуднаВесы				.ТолькоПросмотр = Ложь;
		ЗаполнитьПоВидуОперацииНачатьРазгрузку();
	ИначеЕсли ВидОперации = "ЗакончитьРазгрузку" Тогда
		Элементы.ОбработкаСуднаКоличество		.Видимость = Истина;
		Элементы.ОбработкаСуднаВыгруженПолностью.Видимость = Истина;
		Элементы.ОбработкаСуднаНовыйСилос		.Видимость = Ложь;
		Элементы.ОбработкаСуднаСилос			.ТолькоПросмотр = Истина;
		Элементы.ОбработкаСуднаВесы				.ТолькоПросмотр = Истина;
		ЗаполнитьПоВидуОперацииЗакончитьРазгрузкуСменитьСилос();
	ИначеЕсли ВидОперации = "СменитьСилос" Тогда
		Элементы.ОбработкаСуднаКоличество		.Видимость = Истина;
		Элементы.ОбработкаСуднаВыгруженПолностью.Видимость = Ложь;
		Элементы.ОбработкаСуднаНовыйСилос		.Видимость = Истина;
		Элементы.ОбработкаСуднаСилос			.ТолькоПросмотр = Истина;
		Элементы.ОбработкаСуднаВесы				.ТолькоПросмотр = Истина;
		ЗаполнитьПоВидуОперацииЗакончитьРазгрузкуСменитьСилос();
	Иначе
		Возврат; // Замечания SQ
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоВидуОперацииНачатьРазгрузку()
	
	ИсключаемыеСостояния = Новый Массив;
	ИсключаемыеСостояния.Добавить(Перечисления.гкс_СостоянияОбработкиСудна.Выгружается);
	ИсключаемыеСостояния.Добавить(Перечисления.гкс_СостоянияОбработкиСудна.Выгружен);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Фрахт", Фрахт);
	Запрос.УстановитьПараметр("ИсключаемыеСостояния", ИсключаемыеСостояния);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияОбработкиСудов.Трюм КАК Трюм,
	|	СостоянияОбработкиСудов.Состояние КАК Состояние
	|ПОМЕСТИТЬ СостоянияОбработкиСудов
	|ИЗ
	|	РегистрСведений.гкс_СостоянияОбработкиСудов.СрезПоследних(&Период, Фрахт = &Фрахт) КАК СостоянияОбработкиСудов
	|ИНДЕКСИРОВАТЬ ПО
	|	Трюм
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланыРазгрузкиСудов.Трюм КАК Трюм,
	|	ПланыРазгрузкиСудов.Склад КАК Склад,
	|	ЕСТЬNULL(СостоянияОбработкиСудов.Состояние, ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияОбработкиСудна.ПустаяСсылка)) КАК
	|		Состояние
	|ПОМЕСТИТЬ ТрюмыСостояния
	|ИЗ
	|	РегистрСведений.гкс_ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостоянияОбработкиСудов КАК СостоянияОбработкиСудов
	|		ПО ПланыРазгрузкиСудов.Трюм = СостоянияОбработкиСудов.Трюм
	|ГДЕ
	|	ПланыРазгрузкиСудов.Фрахт = &Фрахт
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Состояние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТрюмыСостояния.Трюм КАК Трюм,
	|	ТрюмыСостояния.Склад КАК Склад
	|ИЗ
	|	ТрюмыСостояния КАК ТрюмыСостояния
	|ГДЕ
	|	НЕ ТрюмыСостояния.Состояние В (&ИсключаемыеСостояния)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Трюм
	|ИТОГИ
	|ПО
	|	Трюм";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаТрюмы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТрюмы.Следующий() Цикл
		
		СтрокаОбработки = ОбработкаСудна.Добавить();
		СтрокаОбработки.Трюм = ВыборкаТрюмы.Трюм;
		
		ВыборкаДетали = ВыборкаТрюмы.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			СтрокаОбработки.ДоступныеСклады.Добавить(ВыборкаДетали.Склад);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоВидуОперацииЗакончитьРазгрузкуСменитьСилос()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Фрахт", Фрахт);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияОбработкиСудов.Фрахт КАК Фрахт,
	|	СостоянияОбработкиСудов.Трюм КАК Трюм,
	|	СостоянияОбработкиСудов.Силос КАК Силос,
	|	СостоянияОбработкиСудов.Весы КАК Весы
	|ПОМЕСТИТЬ СостоянияОбработкиСудов
	|ИЗ
	|	РегистрСведений.гкс_СостоянияОбработкиСудов.СрезПоследних(&Период, Фрахт = &Фрахт) КАК СостоянияОбработкиСудов
	|ГДЕ
	|	СостоянияОбработкиСудов.Состояние = ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияОбработкиСудна.Выгружается)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Фрахт,
	|	Трюм
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияОбработкиСудов.Трюм КАК Трюм,
	|	СостоянияОбработкиСудов.Силос КАК Силос,
	|	СостоянияОбработкиСудов.Весы КАК Весы,
	|	ЕСТЬNULL(ПланыРазгрузкиСудов.Склад, ЗНАЧЕНИЕ(Справочник.гкс_ТочкиМаршрута.ПустаяСсылка)) КАК ДоступныйСклад
	|ИЗ
	|	СостоянияОбработкиСудов КАК СостоянияОбработкиСудов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|		ПО СостоянияОбработкиСудов.Фрахт = ПланыРазгрузкиСудов.Фрахт
	|			И СостоянияОбработкиСудов.Трюм = ПланыРазгрузкиСудов.Трюм
	|
	|УПОРЯДОЧИТЬ ПО
	|	Трюм
	|ИТОГИ
	|	МАКСИМУМ(Силос),
	|	МАКСИМУМ(Весы)
	|ПО
	|	Трюм";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаТрюмы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТрюмы.Следующий() Цикл
		
		СтрокаОбработки = ОбработкаСудна.Добавить();
		СтрокаОбработки.Трюм 	= ВыборкаТрюмы.Трюм;
		СтрокаОбработки.Силос 	= ВыборкаТрюмы.Силос;
		СтрокаОбработки.Весы 	= ВыборкаТрюмы.Весы;
		
		ВыборкаДетали = ВыборкаТрюмы.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			СтрокаОбработки.ДоступныеСклады.Добавить(ВыборкаДетали.ДоступныйСклад);
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПрименитьПоВидуОперацииНачатьРазгрузку()
	
	ВыбранныеСтроки = ОбработкаСудна.Выгрузить(Новый Структура("Флаг", Истина));
	Если ВыбранныеСтроки.Количество() Тогда
		
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		РабочаяСменаОбъект = РабочаяСмена.ПолучитьОбъект();
		Для Каждого ТекущаяСтрока Из ВыбранныеСтроки Цикл
			НоваяСтрока = РабочаяСменаОбъект.ОбработкаСудна.Добавить();
			НоваяСтрока.ДатаНачала 	= ТекущаяДатаСеанса;
			НоваяСтрока.Трюм 		= ТекущаяСтрока.Трюм;
			НоваяСтрока.Силос 		= ТекущаяСтрока.Силос;
			НоваяСтрока.Весы 		= ТекущаяСтрока.Весы;
		КонецЦикла;
		
		РабочаяСменаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
	ПодготовитьФормуПоВидуОперации();
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьПоВидуОперацииЗакончитьРазгрузку()
	
	ВыбранныеСтроки = ОбработкаСудна.Выгрузить(Новый Структура("Флаг", Истина));
	Если ВыбранныеСтроки.Количество() Тогда
		
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		РабочаяСменаОбъект = РабочаяСмена.ПолучитьОбъект();
		Для Каждого ТекущаяСтрока Из ВыбранныеСтроки Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ДатаОкончания"	, гкс_ОбщегоНазначенияКлиентСервер.ПустаяДата());
			Отбор.Вставить("Трюм"			, ТекущаяСтрока.Трюм);
			Отбор.Вставить("Силос"			, ТекущаяСтрока.Силос);
			
			СтрокиСмены = РабочаяСменаОбъект.ОбработкаСудна.НайтиСтроки(Отбор);
			Для Каждого СтрокаСмены Из СтрокиСмены Цикл
				СтрокаСмены.ДатаОкончания 		= ТекущаяДатаСеанса;
				СтрокаСмены.Количество 			= ТекущаяСтрока.Количество;
				СтрокаСмены.ВыгруженПолностью 	= ТекущаяСтрока.ВыгруженПолностью;
			КонецЦикла;
			
		КонецЦикла;
		
		РабочаяСменаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
	ПодготовитьФормуПоВидуОперации();
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьПоВидуОперацииСменитьСилос(ТекстСообщения)
	
	ВыбранныеСтроки = ОбработкаСудна.Выгрузить(Новый Структура("Флаг", Истина));
	Если ВыбранныеСтроки.Количество() Тогда
		
		Если Не ПроверитьЗаполнениеДляВидаОперацииСменитьСилос(ТекстСообщения, ВыбранныеСтроки) Тогда
			Возврат;
		КонецЕсли;
		
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		РабочаяСменаОбъект = РабочаяСмена.ПолучитьОбъект();
		Для Каждого ТекущаяСтрока Из ВыбранныеСтроки Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ДатаОкончания"	, гкс_ОбщегоНазначенияКлиентСервер.ПустаяДата());
			Отбор.Вставить("Трюм"			, ТекущаяСтрока.Трюм);
			Отбор.Вставить("Силос"			, ТекущаяСтрока.Силос);
			СтрокиСмены = РабочаяСменаОбъект.ОбработкаСудна.НайтиСтроки(Отбор);
			Для Каждого СтрокаСмены Из СтрокиСмены Цикл
				// Отразить значения для текущего силоса
				СтрокаСмены.ДатаОкончания 		= ТекущаяДатаСеанса;
				СтрокаСмены.Количество 			= ТекущаяСтрока.Количество;
				СтрокаСмены.ВыгруженПолностью 	= ТекущаяСтрока.ВыгруженПолностью;
			КонецЦикла;
			
			// Добавить строку для нового силоса
			СтрокаСмены = РабочаяСменаОбъект.ОбработкаСудна.Добавить();
			СтрокаСмены.ДатаНачала 	= гкс_ОбщегоНазначенияКлиентСервер.СдвигДаты(ТекущаяДатаСеанса, 1, Неопределено);
			СтрокаСмены.Трюм 		= ТекущаяСтрока.Трюм;
			СтрокаСмены.Силос 		= ТекущаяСтрока.НовыйСилос;
			СтрокаСмены.Весы 		= ТекущаяСтрока.Весы;
			
		КонецЦикла;
		
		РабочаяСменаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
	ПодготовитьФормуПоВидуОперации();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеДляВидаОперацииСменитьСилос(ТекстСообщения, СтрокиОтбора)
	
	Если Не СтрокиОтбора.Найти(0, "Количество") = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Для продолжения укажите количество в отмеченных строках!'");
	ИначеЕсли Не СтрокиОтбора.Найти(Справочники.гкс_ТочкиМаршрута.ПустаяСсылка(), "НовыйСилос") = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Для продолжения укажите Новый силос в отмеченных строках!'");
	Иначе
		ТекстСообщения = "";
	КонецЕсли;
	
	Возврат ПустаяСтрока(ТекстСообщения);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьФлагПоСтрокеОбработкиСудна(ИмяПоля)
	ТекущиеДанные = Элементы.ОбработкаСудна.ТекущиеДанные;
	ТекущиеДанные.Флаг = ЗначениеЗаполнено(ТекущиеДанные[ИмяПоля]);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораСилоса()
	
	ТекущиеДанные = Элементы.ОбработкаСудна.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьРекомендованныеСклады Тогда
		// Задаем параметры выбора (отбор)
		НовыйОтбор = Новый Массив();
		НовыйОтбор.Добавить(
			Новый ПараметрВыбора("Отбор.Ссылка", ТекущиеДанные.ДоступныеСклады.ВыгрузитьЗначения()));
		// Устанавливаем параметры выбора для колонки табличной части
		Элементы.ОбработкаСуднаСилос.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйОтбор);
		Элементы.ОбработкаСуднаНовыйСилос.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйОтбор);
	Иначе
		Элементы.ОбработкаСуднаСилос.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
		Элементы.ОбработкаСуднаНовыйСилос.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьИзменениеВидаОперации()
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Внесенные данные не будут записаны. Продолжить?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьИзменениеВидаОперации", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ПодготовитьФормуПоВидуОперации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьИзменениеВидаОперации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПодготовитьФормуПоВидуОперации();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
